app/controllers/doctors_controller.rb

SELECT "doctors".* FROM "doctors"
---
  def index
    @doctors = Doctor.all

INSERT INTO "doctors" ("firstname", "lastname", "address", "user_id", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["firstname", "strange"], ["lastname", "nil"], ["address", "nil"], ["user_id", 2], ["phone", "8987"], ["created_at", "2017-07-25 18:25:55.022634"], ["updated_at", "2017-07-25 18:25:55.022634"]]
---
  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save

UPDATE "doctors" SET "firstname" = ?, "lastname" = ?, "address" = ?, "phone" = ?, "updated_at" = ? WHERE "doctors"."id" = ?  [["firstname", "Dr. John"], ["lastname", "Doe"], ["address", "Mayor Street, Dublin 1"], ["phone", "089878989"], ["updated_at", "2017-07-27 11:10:13.159315"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @doctor.update(doctor_params)

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."user_id" = ? LIMIT 1  [["user_id", 2]]
---
  def signedinuserdoctor
doctor = Doctor.find_by_user_id(current_user.id)

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_doctor
      @doctor = Doctor.find(params[:id])