app/controllers/pats_controller.rb

  def index
    @pats = Pat.all
---
SELECT "pats".* FROM "pats" WHERE (name LIKE '%asd%' OR appointment LIKE '%asd%')  ORDER BY created_at DESC

  def create
    @pat = Pat.new(pat_params)

    respond_to do |format|
      if @pat.save
---
INSERT INTO "pats" ("name", "phone", "condition", "dob", "appointment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @pat.update(pat_params)
---
UPDATE "pats" SET "name" = ?, "condition" = ?, "updated_at" = ? WHERE "pats"."id" = ?  [["name", "Vikas"], ["condition", "Good"], ["updated_at", "2017-07-27 11:13:28.204906"], ["id", 6]]

    def set_pat
      @pat = Pat.find(params[:id])
---
SELECT  "pats".* FROM "pats" WHERE "pats"."id" = ? LIMIT 1  [["id", 8]]