app/controllers/prints_controller.rb

SELECT "prints".* FROM "prints"
---
  def index
    @prints = Print.all

INSERT INTO "prints" ("name", "case", "prescription", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["case", "Serious"], ["prescription", "nil"], ["published", "2017-09-27"], ["created_at", "2017-07-27 02:48:40.900560"], ["updated_at", "2017-07-27 02:48:40.900560"]]
---
  def create
    @print = Print.new(print_params)

    respond_to do |format|
      if @print.save

SELECT  "prints".* FROM "prints" WHERE "prints"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_print
      @print = Print.find(params[:id])