app/controllers/shifts_controller.rb

  def index
    @shifts = Shift.all
---
SELECT "shifts".* FROM "shifts"

            @shift.cost = myShift.cost
            @shift.description = myShift.details
            respond_to do |format|
              if @shift.save
---
INSERT INTO "shifts" ("firstname", "lastname", "color", "firm", "cost", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_shift
      @shift = Shift.find(params[:id])
---
SELECT  "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT 1  [["id", 1]]