app/controllers/transfers_controller.rb

SELECT "transfers".* FROM "transfers"
---
  def index
    @transfers = Transfer.all