app/controllers/trans_controller.rb

SELECT "trans".* FROM "trans"
---
  def index
    @trans = Tran.all